Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphEventHandler.OnGraphComputeStarted(System.String)
Handles the compute.graph.start notification
graphGuid: The graph GUID

Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphEventHandler.OnGraphComputed(System.String)
Handles the compute.graph.end notification
graphGuid:

Tekla.Structures.TeklaStructuresInternal.MateriaClient.GraphEventHandler.ComputationsFinished
Checks if the computations are finished
Returns: True if the graph computations are finished, false if the computations are still in progress